# 1. 输入成绩，按90/80/70/60分为ABCDE五个等级(课上已经讲过了)
# if-elif-elif-else
# 2.x和y的关系满足如下：
# 	x>=3	y = 2x + 1;
# 	-1<=x<3	y = 2x;
# 	x<=-1	y = 2x – 1;
# 	要求：键盘录入x的值，计算出y的并输出。
# x = int(input("请输入x的值："))
# if(x>=3):
#     y = 2*x+1
# elif(-1<x<3):
#     y=2*x
# elif(x<-1):
#     y = 2*x-1
# else:
#     print("输入的数据不在范围之内")

# print(y)




# 3.键盘录入月份的值，输出对应的季节。
# month = int(input("请输入一个月份："))
# if(month>=1 and month<=3):
#     print("春季")
# elif(month>=4 and month<=6):
#     print("夏季")
# elif(month>=7 and month<=9):
#     print("秋季")
# elif(month>=10 and month<=12):
#     print("冬季")
# else:
#     print("输入数据异常！！！")


# 4.获取二个数据中的最大值(两种方法)
a = 12
b = 23
c = 34
# if(a>b):
#     print(a)
# else:
#     print(b)

if(a>b):
    if(a>c):
        print("最大值是%d"%a)
    else:
        print("最大值是%d"%c)
else:
    if(b>c):
        print("最大值是%d"%b)
    else:
        print("最大值是%d"%c)

# 5、 练习：a = 30, b=9
#  a & b
a = 30
b = 9
print(a & b)  #8
# a的原码：0b00000000 00000000 00000000 00011110
# a的反码：0b00000000 00000000 00000000 00011110
# a的补码：0b00000000 00000000 00000000 00011110
# b的原码：0b00000000 00000000 00000000 00001001
# b的反码：0b00000000 00000000 00000000 00001001
# b的补码：0b00000000 00000000 00000000 00001001


# a的补码：0b00000000 00000000 00000000 00011110
# b的补码：0b00000000 00000000 00000000 00001001
# a&b补码：0b00000000 00000000 00000000 00001000
# a&b反码：0b00000000 00000000 00000000 00001000
# a&b原码：0b00000000 00000000 00000000 00001000  --->8

#  a | b
#  ~a
#  a ^ b
#  a>>1
#  a<<2
