namelist = ["小王","小李"]
while True:
    print("====================学员管理菜单====================")
    print("1-增加新学员 2-更新  3-删除学员  4-查询 5-退出")
    print("====================学员管理菜单====================")
    
    #通过键盘输入一个菜单项（1、2、3、4、5）
    choice = int(input("请选择一个菜单项（输入1~5的数字）："))
    #判断输入时1~5的哪一个？使用if实现
    if choice == 1:
        print("----------------增加新学员----------------------")
        name = input("请输入新增学员的姓名：")
        namelist.append(name)
        print("增加后的学员名单：%s"%namelist)
        print("-----------------------------------------------")
    elif choice ==2:
        print("----------------更新学员信息----------------------")
        oldname = input("请输入已有的姓名：")
        newname = input("请输入需要改为的姓名：")
        namelist[namelist.index(oldname)] = newname
        print("更新后的学员名单：%s"%namelist)
        print("-------------------------------------------------")
    elif choice ==3:
        print("----------------删除学员----------------------")
        oldname = input("请输入要删除的姓名：")
        # del namelist[namelist.index(oldname)]
        namelist.remove(oldname)
        print("删除后的学员名单：%s"%namelist)
        print("-----------------------------------------------")

    elif choice ==4:
        print("-----------------查询学员信息----------------------")
        print("查询学员名单：%s"%namelist)
        print("-----------------------------------------------")
    else:
        print("----------------退出学员管理----------------------")
        print("欢迎再次回来")
        break
        print("-------------------------------------------------")